# -*- coding: utf-8 -*-
"""
@Time    : 2022/6/30  030 上午 11:34
@Author  : Jan
@File    : demo.py
"""
import os
import random
import time
import requests
import pprint

""" {} """

citys = {
    "国外热点地区": ["美国", "英国", "瑞典", "印度", "俄罗斯", "西班牙", "巴西", "德国", "土耳其", "捷克", "加拿大", "意大利", "伊朗", "韩国", "法国", "日本", "瑞士", "挪威", "荷兰", "比利时", "丹麦", "奥地利", "新加坡",
               "马来西亚", "澳大利亚", "巴林", "希腊", "冰岛", "以色列", "阿联酋", "伊拉克", "科威特", "圣马力诺", "埃及", "泰国", "黎巴嫩", "葡萄牙", "芬兰", "菲律宾", "越南", "爱尔兰", "斯洛文尼亚", "巴勒斯坦",
               "罗马尼亚", "印度尼西亚", "卡塔尔", "格鲁吉亚", "波兰", "沙特阿拉伯", "阿尔及利亚", "阿根廷", "巴基斯坦", "阿曼", "智利", "厄瓜多尔", "克罗地亚", "哥斯达黎加", "阿塞拜疆", "匈牙利", "爱沙尼亚", "秘鲁", "阿尔巴尼亚",
               "白俄罗斯", "巴拿马", "拉脱维亚", "斯洛伐克", "南非", "波黑", "墨西哥", "北马其顿", "阿富汗", "文莱", "保加利亚", "马尔代夫", "法属圭亚那", "马耳他", "塞尔维亚", "突尼斯", "多米尼加", "卢森堡", "新西兰",
               "塞内加尔", "马提尼克", "孟加拉国", "哥伦比亚", "摩洛哥", "柬埔寨", "玻利维亚", "圣马丁岛", "布基纳法索", "塞浦路斯", "法罗群岛", "巴拉圭", "喀麦隆", "立陶宛", "尼日利亚", "斯里兰卡", "格恩西岛", "圣巴泰勒米岛",
               "牙买加", "刚果（金）", "蒙古国", "摩尔多瓦", "多哥", "梵蒂冈", "直布罗陀", "不丹", "列支敦士登", "乌克兰", "约旦", "安道尔", "亚美尼亚", "摩纳哥", "尼泊尔", "留尼汪岛", "科特迪瓦", "法属波利尼西亚", "古巴",
               "洪都拉斯", "加纳", "加蓬", "特立尼达和多巴哥", "苏里南", "格陵兰岛", "海峡群岛", "阿拉伯联合酋长国", "马尔维纳斯群岛", "也门", "圣皮埃尔", "圣多美和普林西比", "南苏丹", "马拉维", "布隆迪", "塞拉利昂", "博茨瓦纳",
               "百慕大", "英属维尔京群岛", "安圭拉", "格林纳达", "圣基茨和尼维斯", "特克斯和凯科斯群岛", "几内亚比绍", "马里", "利比亚", "老挝", "伯利兹", "缅甸", "多米尼克", "莫桑比克", "叙利亚", "马恩岛", "巴布亚新几内亚",
               "厄立特里亚", "乌干达", "安哥拉", "东帝汶", "新喀里多尼亚", "马达加斯加", "津巴布韦", "佛得角", "蒙特塞拉特", "海地", "尼日尔", "乍得", "萨尔瓦多", "尼加拉瓜", "斐济", "毛里求斯", "赞比亚", "吉布提", "吉尔吉斯斯坦",
               "巴巴多斯", "黑山", "冈比亚", "贝宁", "索马里", "坦桑尼亚", "利比里亚", "圭亚那合作共和国", "马约特", "巴哈马", "乌兹别克斯坦", "瓜德罗普", "开曼群岛", "刚果（布）", "中非共和国", "塞舌尔", "赤道几内亚", "纳米比亚",
               "卢旺达", "斯威士兰", "毛里塔尼亚", "阿鲁巴", "钻石公主号邮轮", "库拉索", "圣卢西亚", "圣文森特和格林纳丁斯", "安提瓜和巴布达", "危地马拉", "乌拉圭", "委内瑞拉", "苏丹", "几内亚", "埃塞俄比亚", "哈萨克斯坦", "肯尼亚"],
    "国内热点地区": ["北京", "上海", "天津", "重庆", "广州", "深圳", "杭州", "成都"],
    "北京": ["东城区", "西城区", "朝阳区", "丰台区", "石景山区", "海淀区", "顺义区", "通州区", "大兴区", "房山区", "门头沟区", "昌平区", "平谷区", "密云区", "怀柔区", "延庆区"],
    "天津": ["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "滨海新区", "东丽区", "西青区", "津南区", "北辰区", "武清区", "宝坻区", "宁河区", "静海区", "蓟州区"],
    "上海": ["黄浦区", "徐汇区", "长宁区", "静安区", "普陀区", "虹口区", "杨浦区", "闵行区", "宝山区", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "奉贤区", "崇明区"],
    "重庆": ["渝中区", "万州区", "涪陵区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "綦江区", "大足区", "渝北区", "巴南区", "黔江区", "长寿区", "江津区", "合川区", "永川区", "南川区", "璧山区", "铜梁区",
           "潼南区", "荣昌区", "开州区", "梁平区", "武隆县", "城口县", "丰都县", "垫江县", "忠县", "云阳县", "奉节县", "巫山县", "巫溪县", "石柱县", "秀山县", "酉阳县", "彭水县"],
    "安徽": ["合肥", "安庆", "蚌埠", "亳州", "池州", "滁州", "阜阳", "淮北", "黄山", "六安", "马鞍山", "宿州", "铜陵", "芜湖", "宣城", "淮南"],
    "福建": ["福州", "龙岩", "南平", "宁德", "莆田", "泉州", "三明", "厦门", "漳州"],
    "广东": ["广州", "潮州", "东莞", "佛山", "河源", "惠州", "江门", "揭阳", "茂名", "梅州", "清远", "汕头", "汕尾", "韶关", "深圳", "阳江", "云浮", "湛江", "肇庆", "中山", "珠海"],
    "广西": ["南宁", "百色", "北海", "崇左", "防城港", "桂林", "贵港", "河池", "贺州", "来宾", "柳州", "钦州", "梧州", "玉林"],
    "贵州": ["贵阳", "安顺", "毕节地区", "六盘水", "铜仁地区", "遵义", "黔西南州", "黔东南州", "黔南州"],
    "甘肃": ["兰州", "白银", "定西", "甘南州", "嘉峪关", "金昌", "酒泉", "临夏州", "陇南", "平凉", "庆阳", "天水", "武威", "张掖"],
    "海南": ["海口", "白沙黎族自治县", "保亭黎族苗族自治县", "昌江黎族自治县", "儋州", "澄迈", "东方", "定安", "琼海", "琼中黎族苗族自治县", "乐东黎族自治县", "临高", "陵水黎族自治县", "三亚", "屯昌", "万宁", "文昌", "五指山", "三沙"],
    "河南": ["郑州", "安阳", "鹤壁", "焦作", "开封", "洛阳", "漯河", "南阳", "平顶山", "濮阳", "三门峡", "商丘", "新乡", "信阳", "许昌", "周口", "驻马店", "济源"],
    "黑龙江": ["哈尔滨", "大庆", "大兴安岭地区", "鹤岗", "黑河", "鸡西", "佳木斯", "牡丹江", "七台河", "齐齐哈尔", "双鸭山", "绥化", "伊春"],
    "湖北": ["武汉", "鄂州", "恩施", "黄冈", "黄石", "荆门", "荆州", "潜江", "神农架林区", "十堰", "随州", "天门", "仙桃", "咸宁", "襄阳", "孝感", "宜昌"],
    "湖南": ["长沙", "常德", "郴州", "衡阳", "怀化", "娄底", "邵阳", "湘潭", "湘西州", "益阳", "永州", "岳阳", "张家界", "株洲"],
    "河北": ["石家庄", "保定", "沧州", "承德", "邯郸", "衡水", "廊坊", "秦皇岛", "唐山", "邢台", "张家口"],
    "江苏": ["南京", "常州", "淮安", "连云港", "南通", "苏州", "宿迁", "泰州", "无锡", "徐州", "盐城", "扬州", "镇江"],
    "江西": ["南昌", "抚州", "赣州", "吉安", "景德镇", "九江", "萍乡", "上饶", "新余", "宜春", "鹰潭"],
    "吉林": ["长春", "白城", "白山", "吉林市", "辽源", "四平", "松原", "通化", "延边", "梅河口"],
    "辽宁": ["沈阳", "鞍山", "本溪", "朝阳", "大连", "丹东", "抚顺", "阜新", "葫芦岛", "锦州", "辽阳", "盘锦", "铁岭", "营口"],
    "宁夏": ["银川", "固原", "石嘴山", "吴忠", "中卫"],
    "内蒙古": ["呼和浩特", "阿拉善盟", "包头", "巴彦淖尔", "赤峰", "鄂尔多斯", "呼伦贝尔", "通辽", "乌海", "乌兰察布", "锡林郭勒盟", "兴安盟"],
    "青海": ["西宁", "果洛州", "海东地区", "海北州", "海南州", "海西州", "黄南州", "玉树州"],
    "山东": ["济南", "滨州", "东营", "德州", "菏泽", "济宁", "聊城", "临沂", "青岛", "日照", "泰安", "威海", "潍坊", "烟台", "枣庄", "淄博"],
    "山西": ["太原", "长治", "大同", "晋城", "晋中", "临汾", "吕梁", "朔州", "忻州", "阳泉", "运城"],
    "陕西": ["西安", "安康", "宝鸡", "汉中", "商洛", "铜川", "渭南", "咸阳", "延安", "榆林", "杨凌示范区"],
    "四川": ["成都", "阿坝州", "巴中", "达州", "德阳", "甘孜州", "广安", "广元", "乐山", "凉山州", "泸州", "南充", "眉山", "绵阳", "内江", "攀枝花", "遂宁", "雅安", "宜宾", "资阳", "自贡"],
    "台湾": [],
    "西藏": ["拉萨", "阿里地区", "昌都地区", "林芝地区", "那曲地区", "日喀则地区", "山南地区"],
    "新疆": ["乌鲁木齐", "阿拉尔", "阿克苏地区", "阿勒泰地区", "巴音郭楞蒙古自治州", "博尔塔拉州", "昌吉州", "哈密地区", "和田地区", "喀什地区", "克拉玛依", "克孜勒苏州", "石河子", "塔城地区", "图木舒克", "吐鲁番地区", "五家渠", "伊犁州",
           "北屯", "铁门关", "双河", "可克达拉", "昆玉"],
    "云南": ["昆明", "保山", "楚雄州", "大理州", "德宏州", "迪庆州", "红河州", "丽江", "临沧", "怒江州", "普洱", "曲靖", "昭通", "文山", "西双版纳傣族自治州", "玉溪"],
    "浙江": ["杭州", "湖州", "嘉兴", "金华", "丽水", "宁波", "衢州", "绍兴", "台州", "温州", "舟山"],
    "香港": [],
    "澳门": [],
    "亚洲": ["韩国", "日本", "伊朗", "土耳其", "蒙古国", "塞浦路斯", "文莱", "孟加拉国", "马尔代夫", "不丹", "巴勒斯坦", "沙特阿拉伯", "约旦", "印度尼西亚", "亚美尼亚", "卡塔尔", "阿塞拜疆", "格鲁吉亚", "巴基斯坦", "阿曼",
           "阿富汗", "巴林", "科威特", "伊拉克", "黎巴嫩", "以色列", "印度", "菲律宾", "阿联酋", "斯里兰卡", "柬埔寨", "尼泊尔", "越南", "马来西亚", "新加坡", "泰国"],
    "欧洲": ["意大利", "格恩西岛", "圣马丁岛", "圣巴泰勒米岛", "法罗群岛", "阿尔巴尼亚", "保加利亚", "摩尔多瓦", "马耳他", "斯洛伐克", "梵蒂冈", "塞尔维亚", "直布罗陀", "列支敦士登", "波黑", "匈牙利", "斯洛文尼亚", "波兰", "乌克兰",
           "拉脱维亚", "葡萄牙", "安道尔", "捷克", "爱尔兰", "卢森堡", "圣马力诺", "摩纳哥", "冰岛", "白俄罗斯", "立陶宛", "荷兰", "爱沙尼亚", "丹麦", "罗马尼亚", "北马其顿", "挪威", "希腊", "瑞士", "克罗地亚", "奥地利",
           "比利时", "西班牙", "瑞典", "俄罗斯", "英国", "芬兰", "德国", "法国"],
    "南美洲": ["玻利维亚", "法属圭亚那", "巴拉圭", "哥伦比亚", "秘鲁", "阿根廷", "智利", "厄瓜多尔", "巴西", "苏里南"],
    "北美洲": ["牙买加", "巴拿马", "马提尼克", "哥斯达黎加", "多米尼加", "墨西哥", "加拿大", "美国", "古巴", "洪都拉斯", "特立尼达和多巴哥", "格陵兰岛"],
    "非洲": ["刚果（金）", "布基纳法索", "多哥", "喀麦隆", "南非", "突尼斯", "塞内加尔", "摩洛哥", "尼日利亚", "埃及", "阿尔及利亚", "留尼汪岛", "科特迪瓦", "加纳", "加蓬"],
    "大洋洲": ["新西兰", "澳大利亚", "法属波利尼西亚"],
    "热门": ["意大利", "伊朗", "韩国", "法国", "西班牙", "德国", "日本", "美国", "瑞士", "挪威", "英国", "荷兰", "瑞典", "比利时", "丹麦", "奥地利", "新加坡", "马来西亚", "澳大利亚", "巴林", "加拿大", "希腊", "冰岛",
           "以色列", "阿联酋", "伊拉克", "科威特", "圣马力诺", "印度", "捷克", "埃及", "泰国", "黎巴嫩", "葡萄牙", "芬兰", "菲律宾", "越南", "爱尔兰", "巴西", "斯洛文尼亚", "巴勒斯坦", "罗马尼亚", "印度尼西亚", "卡塔尔",
           "格鲁吉亚", "波兰", "沙特阿拉伯", "阿尔及利亚", "俄罗斯", "阿根廷", "巴基斯坦", "阿曼", "智利", "厄瓜多尔", "克罗地亚", "哥斯达黎加", "阿塞拜疆", "匈牙利", "爱沙尼亚", "秘鲁", "阿尔巴尼亚", "白俄罗斯", "巴拿马",
           "拉脱维亚", "斯洛伐克", "南非", "波黑", "墨西哥", "北马其顿", "阿富汗", "文莱", "保加利亚", "马尔代夫", "法属圭亚那", "马耳他", "塞尔维亚", "突尼斯", "多米尼加", "卢森堡", "新西兰", "塞内加尔", "马提尼克", "孟加拉国",
           "哥伦比亚", "摩洛哥", "柬埔寨", "玻利维亚", "圣马丁岛", "布基纳法索", "塞浦路斯", "法罗群岛", "巴拉圭", "喀麦隆", "立陶宛", "尼日利亚", "斯里兰卡", "格恩西岛", "圣巴泰勒米岛", "牙买加", "土耳其", "刚果（金）", "蒙古国",
           "摩尔多瓦", "多哥", "梵蒂冈", "直布罗陀", "不丹", "列支敦士登", "乌克兰", "约旦", "安道尔", "亚美尼亚", "摩纳哥", "尼泊尔", "留尼汪岛", "科特迪瓦", "法属波利尼西亚", "古巴", "洪都拉斯", "加纳", "加蓬",
           "特立尼达和多巴哥", "苏里南", "格陵兰岛"]
}
home = ["国内热点地区", "北京", "天津", "上海", "重庆", "安徽", "福建", "广东", "广西", "贵州", "甘肃", "海南", "河南", "黑龙江", "湖北", "湖南", "河北", "江苏", "江西", "吉林", "辽宁", "宁夏", "内蒙古",
        "青海", "山东", "山西", "陕西", "四川", "台湾", "西藏", "新疆", "云南", "浙江", "香港", "澳门"]
data = []
for city in citys:
    if city in home:
        isCaseIn = 1
        if citys[city] != '':
            for name in citys[city]:
                area = f"{city}-{name}"
                target = "trendCity"
                data.append((area, target, isCaseIn))
        area = city
        target = "trend"
        # print(area, target)
        data.append((area, target, isCaseIn))
    else:
        isCaseIn = 0
        for name in citys[city]:
            area = f"{name}"
            target = "trend"
            data.append((area, target, isCaseIn))
    # break
# print(data)

start_num = 0
if os.path.exists('start_num.txt'):
    with open('start_num.txt', mode='r') as f:
        start_num = int(f.read())

for li in data[start_num:]:
    try:
        headers = {"User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/102.0.5005.124 Safari/537.36"}
        url = 'https://voice.baidu.com/newpneumonia/getv2'
        params = {
            "from": "mola-virus",
            "stage": "publish",
            "area": li[0],
            "target": li[1],
            "isCaseIn": li[2],
            # "area": "北京-西城区",
            # "target": "trend",  # 隶属城区改为 trendCity
            # "target": "trendCity",  # 隶属城区改为 trendCity
            # "isCaseIn": "1",
            # "callback": f"jsonp_{str(int(time.time() * 1000))}_{str(int(random.random() * 100000))}"
        }

        response = requests.get(url, headers=headers, params=params, data={})
        data = response.text
        if response.json()['status']:
            data = response.url
        # time.sleep(1)
        with open('data.text', mode='a', encoding='utf-8') as f:
            f.write(data)
            f.write('\n')
        # print(response)
        print(response.status_code, data)
        start_num += 1

    except:
        with open('start_num.txt', mode='w') as f:
            f.write(str(start_num))
